Repository: felipepessoto/FujiyNotepad
Catalog: src/FujiyNotepad.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: pt_br

# FileMenu.Title
source: File
pt_br: Arquivo

# OpenItem.Text
source: Open...
pt_br: Abrir...

# OpenSampleItem.Text
source: Open Sample
pt_br: Abrir Exemplo

# RecentMenu.Text
source: Open Recent
pt_br: Abrir Recentes

# ReopenLastToggle.Text
source: Reopen Last File on Startup
pt_br: Reabrir Último Arquivo ao Iniciar

# ReloadItem.Text
source: Reload
pt_br: Recarregar

# CloseItem.Text
source: Close
pt_br: Fechar

# CopyPathItem.Text
source: Copy File Path
pt_br: Copiar Caminho do Arquivo

# RevealItem.Text
source: Reveal in Explorer
pt_br: Mostrar no Explorador

# ExitItem.Text
source: Exit
pt_br: Sair

# EditMenu.Title
source: Edit
pt_br: Editar

# GoToLineItem.Text
source: Go To Line...
pt_br: Ir Para Linha...

# GoToOffsetItem.Text
source: Go To Offset...
pt_br: Ir Para Deslocamento...

# GoToPercentItem.Text
source: Go To Percentage...
pt_br: Ir Para Porcentagem...

# FindItem.Text
source: Find...
pt_br: Localizar...

# FilterItem.Text
source: Filter...
pt_br: Filtrar...

# CopyMatchingItem.Text
source: Copy Matching Lines
pt_br: Copiar Linhas Correspondentes

# SaveMatchingItem.Text
source: Save Matching Lines As...
pt_br: Salvar Linhas Correspondentes Como...

# ClearSearchHistoryItem.Text
source: Clear Search History
pt_br: Limpar Histórico de Pesquisa

# ToggleBookmarkItem.Text
source: Toggle Bookmark
pt_br: Alternar Marcador

# NextBookmarkItem.Text
source: Next Bookmark
pt_br: Próximo Marcador

# PreviousBookmarkItem.Text
source: Previous Bookmark
pt_br: Marcador Anterior

# ClearBookmarksItem.Text
source: Clear All Bookmarks
pt_br: Limpar Todos os Marcadores

# CopyWithLineNumbersItem.Text
source: Copy with Line Numbers
pt_br: Copiar com Números de Linha

# StartIndexingItem.Text
source: Start indexing
pt_br: Iniciar indexação

# StopIndexingItem.Text
source: Stop indexing
pt_br: Parar indexação

# TabWidthSubMenu.Text
source: Tab Width
pt_br: Largura da Tabulação

# ViewMenu.Title
source: View
pt_br: Exibir

# LineNumbersToggle.Text
source: Line Numbers
pt_br: Números de Linha

# WhitespaceToggle.Text
source: Show Whitespace
pt_br: Mostrar Espaços em Branco

# FollowTailToggle.Text
source: Follow Tail
pt_br: Acompanhar Final

# ZoomInItem.Text
source: Zoom In
pt_br: Ampliar

# ZoomOutItem.Text
source: Zoom Out
pt_br: Reduzir

# ResetZoomItem.Text
source: Reset Zoom
pt_br: Redefinir Zoom

# FontSubMenu.Text
source: Font
pt_br: Fonte

# ThemeSubMenu.Text
source: Theme
pt_br: Tema

# ThemeSystem.Text
source: System
pt_br: Sistema

# ThemeLight.Text
source: Light
pt_br: Claro

# ThemeDark.Text
source: Dark
pt_br: Escuro

# HighlightRulesItem.Text
source: Highlight Rules...
pt_br: Regras de Realce...

# EncodingMenu.Title
source: Encoding
pt_br: Codificação

# EncAuto.Text
source: Auto-detect
pt_br: Detectar automaticamente

# HelpMenu.Title
source: Help
pt_br: Ajuda

# AboutItem.Text
source: About FujiyNotepad...
pt_br: Sobre o FujiyNotepad...

# ReloadHint.Content
source: ↻ File changed on disk — Reload
pt_br: ↻ Arquivo alterado no disco — Recarregar

# CountCharsLink.Content
source: Count characters
pt_br: Contar caracteres

# StatusFollowingSuffix
source: Following
pt_br: Acompanhando

# StatusCounting
source: counting…
pt_br: contando…

# FindBox.PlaceholderText
source: Find
pt_br: Localizar

# MatchCaseToggle.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Match case
pt_br: Diferenciar maiúsculas/minúsculas

# MatchCaseToggle.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Match case
pt_br: Diferenciar maiúsculas/minúsculas

# WholeWordToggle.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Match whole word
pt_br: Coincidir palavra inteira

# WholeWordToggle.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Match whole word
pt_br: Coincidir palavra inteira

# RegexToggle.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Use regular expression
pt_br: Usar expressão regular

# RegexToggle.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Use regular expression
pt_br: Usar expressão regular

# FindPrevButton.Content
source: Find Previous
pt_br: Localizar Anterior

# FindPrevButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Find previous (Shift+F3)
pt_br: Localizar anterior (Shift+F3)

# FindNextButton.Content
source: Find Next
pt_br: Localizar Próximo

# FindNextButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Find next (F3)
pt_br: Localizar próximo (F3)

# FindCancelButton.Content
source: Cancel
pt_br: Cancelar

# FindCloseButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Close find bar
pt_br: Fechar barra de localização

# FindCloseButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Close
pt_br: Fechar

# FilterBox.PlaceholderText
source: Filter — show only lines that match
pt_br: Filtrar — mostrar apenas linhas correspondentes

# FilterMatchCase.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Match case
pt_br: Diferenciar maiúsculas/minúsculas

# FilterMatchCase.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Match case
pt_br: Diferenciar maiúsculas/minúsculas

# FilterRegex.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Use regular expression
pt_br: Usar expressão regular

# FilterRegex.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Use regular expression
pt_br: Usar expressão regular

# FilterApplyButton.Content
source: Apply
pt_br: Aplicar

# FilterApplyButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Show only matching lines (Enter)
pt_br: Mostrar apenas linhas correspondentes (Enter)

# FilterCloseButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Clear filter and close
pt_br: Limpar filtro e fechar

# FilterCloseButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Clear filter and close (Esc)
pt_br: Limpar filtro e fechar (Esc)

# DialogGo
source: Go
pt_br: Ir

# DialogCancel
source: Cancel
pt_br: Cancelar

# DialogClose
source: Close
pt_br: Fechar

# DialogApply
source: Apply
pt_br: Aplicar

# GoToLineTitle
source: Go To Line
pt_br: Ir Para Linha

# GoToLinePlaceholder
source: Line number
pt_br: Número da linha

# GoToOffsetTitle
source: Go To Offset
pt_br: Ir Para Deslocamento

# GoToOffsetPlaceholder
source: Byte offset (decimal, or 0x for hex)
pt_br: Deslocamento em bytes (decimal ou 0x para hex)

# GoToPercentTitle
source: Go To Percentage
pt_br: Ir Para Porcentagem

# GoToPercentPlaceholder
source: Percentage of the file (0-100)
pt_br: Porcentagem do arquivo (0-100)

# OpenErrorTitle
source: Can't open file
pt_br: Não é possível abrir o arquivo

# OpenErrorContent
source: Could not open “{0}”. {1}
pt_br: Não foi possível abrir “{0}”. {1}

# ErrorFileNotFound
source: The file was not found.
pt_br: O arquivo não foi encontrado.

# ErrorDirNotFound
source: The folder was not found.
pt_br: A pasta não foi encontrada.

# ErrorNoPermission
source: You don't have permission to read it.
pt_br: Você não tem permissão para lê-lo.

# AboutTitle
source: About
pt_br: Sobre

# AboutVersion
source: Version {0}
pt_br: Versão {0}

# AboutDescription
source: A lightweight Windows viewer for very large text files.
pt_br: Um visualizador leve do Windows para arquivos de texto muito grandes.

# AboutLicense
source: MIT License — Copyright © 2017 Felipe Pessoto
pt_br: Licença MIT — Copyright © 2017 Felipe Pessoto

# HighlightRulesTitle
source: Highlight Rules
pt_br: Regras de Realce

# InsertPresetText
source: Insert preset
pt_br: Inserir predefinição

# InsertPresetName
source: Insert highlight preset
pt_br: Inserir predefinição de realce

# HighlightRulesHelp
source: One rule per line: color[/flags] pattern Colors: red, orange, amber, yellow, green, teal, blue, cyan, purple, pink, gray, or #RRGGBB. Flags: /regex and/or /case (e.g. blue/regex,case). Lines starting with # are comments.
pt_br: Uma regra por linha: cor[/sinalizadores] padrão Cores: red, orange, amber, yellow, green, teal, blue, cyan, purple, pink, gray, ou #RRGGBB. Sinalizadores: /regex e/ou /case (ex.: blue/regex,case). Linhas começando com # são comentários.
